mamedev/mame/src/devices/cpu/tms320c5x/tms320c5x_dasm.cpp
// license:BSD-3-Clause
// copyright-holders:Ville Linde

#include "emu.h"
#include "tms320c5x_dasm.h"


const char *const tms320c5x_disassembler::zl_condition_codes[] =
{
	// bit 3, 2 (ZL), bit 1, 0 (MASK)
	"",             // Z=0, L=0, ZM=0, ZL=0
	"gt",           // Z=0, L=0, ZM=0, ZL=1
	"neq",          // Z=0, L=0, ZM=1, ZL=0
	"gt",           // Z=0, L=0, ZM=1, ZL=1
	"",             // Z=0, L=1, ZM=0, ZL=0
	"lt",           // Z=0, L=1, ZM=0, ZL=1
	"neq",          // Z=0, L=1, ZM=1, ZL=0
	"lt",           // Z=0, L=1, ZM=1, ZL=1
	"",             // Z=1, L=0, ZM=0, ZL=0
	"gt",           // Z=1, L=0, ZM=0, ZL=1
	"eq",           // Z=1, L=0, ZM=1, ZL=0
	"geq",          // Z=1, L=0, ZM=1, ZL=1
	"",             // Z=1, L=1, ZM=0, ZL=0
	"lt",           // Z=1, L=1, ZM=0, ZL=1
	"eq",           // Z=1, L=1, ZM=1, ZL=0
	"leq",          // Z=1, L=1, ZM=1, ZL=1
};

const char *const tms320c5x_disassembler::cv_condition_codes[16] =
{
	"",             // V=0, C=0, VM=0, CM=0
	"nc",           // V=0, C=0, VM=0, CM=1
	"nov",          // V=0, C=0, VM=1, CM=0
	"nc nov",       // V=0, C=0, VM=1, CM=1
	"",             // V=0, C=1, VM=0, CM=0
	"c",            // V=0, C=1, VM=0, CM=1
	"nov",          // V=0, C=1, VM=1, CM=0
	"c nov",        // V=0, C=1, VM=1, CM=1
	"",             // V=1, C=0, VM=0, CM=0
	"nc",           // V=1, C=0, VM=0, CM=1
	"ov",           // V=1, C=0, VM=1, CM=0
	"nc ov",        // V=1, C=0, VM=1, CM=1
	"",             // V=1, C=1, VM=0, CM=0
	"c",            // V=1, C=1, VM=0, CM=1
	"ov",           // V=1, C=1, VM=1, CM=0
	"c ov",         // V=1, C=1, VM=1, CM=1
};

const char *const tms320c5x_disassembler::tp_condition_codes[4] =
{
	"bio",
	"tc",
	"ntc",
	""
};

uint16_t tms320c5x_disassembler::FETCH(offs_t &npc, const data_buffer &opcodes)
{
	return opcodes.r16(npc++);
}

std::string tms320c5x_disassembler::GET_ADDRESS(int addr_mode, int address)
{
	if (addr_mode)      // Indirect addressing
	{
		int nar = address & 0x7;


		switch ((address >> 3) & 0xf)
		{
			case 0x0:   return util::string_format("*");
			case 0x1:   return util::string_format("*, ar%d", nar);
			case 0x2:   return util::string_format("*-");
			case 0x3:   return util::string_format("*-, ar%d", nar);
			case 0x4:   return util::string_format("*+");
			case 0x5:   return util::string_format("*+, ar%d", nar);
			case 0x8:   return util::string_format("*br0-");
			case 0x9:   return util::string_format("*br0-, ar%d", nar);
			case 0xa:   return util::string_format("*0-");
			case 0xb:   return util::string_format("*0-, ar%d", nar);
			case 0xc:   return util::string_format("*0+");
			case 0xd:   return util::string_format("*0+, ar%d", nar);
			case 0xe:   return util::string_format("*br0+");
			case 0xf:   return util::string_format("*br0+, ar%d", nar);

			default:    return util::string_format("??? (indirect)");
		}
	}
	else            // Direct addressing
	{
		return util::string_format("#%02X", address);
	}
}

std::string tms320c5x_disassembler::GET_SHIFT(int shift)
{
	if (shift > 0)
	{
		return util::string_format(", %d", shift);
	}
	else
	{
		return "";
	}
}

void tms320c5x_disassembler::print_condition_codes(bool pp, int zl, int cv, int tp)
{
	if (*(zl_condition_codes[zl]) != 0)
	{
		if (pp)
			util::stream_format(*output, ", ");
		util::stream_format(*output, "%s", zl_condition_codes[zl]);
		pp = true;
	}
	if (*(cv_condition_codes[cv]) != 0)
	{
		if (pp)
			util::stream_format(*output, ", ");
		util::stream_format(*output, "%s", cv_condition_codes[cv]);
		pp = true;
	}
	if (*(tp_condition_codes[tp]) != 0)
	{
		if (pp)
			util::stream_format(*output, ", ");
		util::stream_format(*output, "%s", tp_condition_codes[tp]);
	}
}

uint32_t tms320c5x_disassembler::dasm_group_be(uint16_t opcode, offs_t &npc, const data_buffer &opcodes)
{
	int subop = opcode & 0xff;
	uint32_t flags = 0;

	switch (subop)
	{
		case 0x00:  util::stream_format(*output, "abs"); break;
		case 0x01:  util::stream_format(*output, "cmpl"); break;
		case 0x02:  util::stream_format(*output, "neg"); break;
		case 0x03:  util::stream_format(*output, "pac"); break;
		case 0x04:  util::stream_format(*output, "apac"); break;
		case 0x05:  util::stream_format(*output, "spac"); break;
		case 0x09:  util::stream_format(*output, "sfl"); break;
		case 0x0a:  util::stream_format(*output, "sfr"); break;
		case 0x0c:  util::stream_format(*output, "rol"); break;
		case 0x0d:  util::stream_format(*output, "ror"); break;
		case 0x10:  util::stream_format(*output, "addb"); break;
		case 0x11:  util::stream_format(*output, "adcb"); break;
		case 0x12:  util::stream_format(*output, "andb"); break;
		case 0x13:  util::stream_format(*output, "orb"); break;
		case 0x14:  util::stream_format(*output, "rolb"); break;
		case 0x15:  util::stream_format(*output, "rorb"); break;
		case 0x16:  util::stream_format(*output, "sflb"); break;
		case 0x17:  util::stream_format(*output, "sfrb"); break;
		case 0x18:  util::stream_format(*output, "sbb"); break;
		case 0x19:  util::stream_format(*output, "sbbb"); break;
		case 0x1a:  util::stream_format(*output, "xorb"); break;
		case 0x1b:  util::stream_format(*output, "crgt"); break;
		case 0x1c:  util::stream_format(*output, "crlt"); break;
		case 0x1d:  util::stream_format(*output, "exar"); break;
		case 0x1e:  util::stream_format(*output, "sacb"); break;
		case 0x1f:  util::stream_format(*output, "lacb"); break;
		case 0x20:  util::stream_format(*output, "bacc"); break;
		case 0x21:  util::stream_format(*output, "baccd"); break;
		case 0x22:  util::stream_format(*output, "idle"); break;
		case 0x23:  util::stream_format(*output, "idle2"); break;
		case 0x30:  util::stream_format(*output, "cala"); break;
		case 0x32:  util::stream_format(*output, "pop"); break;
		case 0x38:  util::stream_format(*output, "reti"); break;
		case 0x3a:  util::stream_format(*output, "rete"); break;
		case 0x3c:  util::stream_format(*output, "push"); break;
		case 0x3d:  util::stream_format(*output, "calad"); break;
		case 0x40:  util::stream_format(*output, "clrc    intm"); break;
		case 0x41:  util::stream_format(*output, "setc    intm"); break;
		case 0x42:  util::stream_format(*output, "clrc    ovm"); break;
		case 0x43:  util::stream_format(*output, "setc    ovm"); break;
		case 0x44:  util::stream_format(*output, "clrc    cnf"); break;
		case 0x45:  util::stream_format(*output, "setc    cnf"); break;
		case 0x46:  util::stream_format(*output, "clrc    sxm"); break;
		case 0x47:  util::stream_format(*output, "setc    sxm"); break;
		case 0x48:  util::stream_format(*output, "clrc    hold"); break;
		case 0x49:  util::stream_format(*output, "setc    hold"); break;
		case 0x4a:  util::stream_format(*output, "clrc    tc"); break;
		case 0x4b:  util::stream_format(*output, "setc    tc"); break;
		case 0x4c:  util::stream_format(*output, "clrc    xf"); break;
		case 0x4d:  util::stream_format(*output, "setc    xf"); break;
		case 0x4e:  util::stream_format(*output, "clrc    carry"); break;
		case 0x4f:  util::stream_format(*output, "setc    carry"); break;
		case 0x51:  util::stream_format(*output, "trap"); flags = STEP_OVER; break;
		case 0x52:  util::stream_format(*output, "nmi"); flags = STEP_OVER; break;
		case 0x58:  util::stream_format(*output, "zpr"); break;
		case 0x59:  util::stream_format(*output, "zap"); break;
		case 0x5a:  util::stream_format(*output, "sath"); break;
		case 0x5b:  util::stream_format(*output, "satl"); break;
		case 0x60: case 0x61: case 0x62: case 0x63:
		case 0x64: case 0x65: case 0x66: case 0x67:
		case 0x68: case 0x69: case 0x6a: case 0x6b:
		case 0x6c: case 0x6d: case 0x6e: case 0x6f:
		case 0x70: case 0x71: case 0x72: case 0x73:
		case 0x74: case 0x75: case 0x76: case 0x77:
		case 0x78: case 0x79: case 0x7a: case 0x7b:
		case 0x7c: case 0x7d: case 0x7e: case 0x7f:
					util::stream_format(*output, "intr    %d", opcode & 0x1f); flags = STEP_OVER; break;

		case 0x80:  util::stream_format(*output, "mpy     #%04X", FETCH(npc, opcodes)); break;
		case 0x81:  util::stream_format(*output, "and     #%04X", FETCH(npc, opcodes) << 16); break;
		case 0x82:  util::stream_format(*output, "or      #%04X", FETCH(npc, opcodes) << 16); break;
		case 0x83:  util::stream_format(*output, "xor     #%04X", FETCH(npc, opcodes) << 16); break;
		case 0xc4:  util::stream_format(*output, "rpt     #%04X", FETCH(npc, opcodes)); break;
		case 0xc5:  util::stream_format(*output, "rptz    #%04X", FETCH(npc, opcodes)); break;
		case 0xc6:  util::stream_format(*output, "rptb    #%04X", FETCH(npc, opcodes)); break;

		default:    util::stream_format(*output, "???     (group be)"); break;
	}
	return flags;
}

