mamedev/mame/src/devices/cpu/tms320c5x/tms320c5x_dasm.cpp
		case 0xbc:
		case 0xbd:
		{
			util::stream_format(*output, "ldp     #%03X", opcode & 0x1ff);
			break;
		}
		case 0xbe:  flags = dasm_group_be(opcode, npc, opcodes); break;
		case 0xbf:  dasm_group_bf(opcode, npc, opcodes); break;

		case 0xe0: case 0xe1: case 0xe2: case 0xe3:
		{
			int zlcvmask = opcode & 0xf;
			int zlcv = (opcode >> 4) & 0xf;
			int zl = (zlcv & 0xc) | ((zlcvmask >> 2) & 0x3);
			int cv = ((zlcv << 2) & 0xc) | (zlcvmask & 0x3);
			int tp = (opcode >> 8) & 0x3;

			util::stream_format(*output, "bcnd    %04X", FETCH(npc, opcodes));
			print_condition_codes(true, zl, cv, tp);
			flags = STEP_COND;
			break;
		}

		case 0xe4: case 0xe5: case 0xe6: case 0xe7:
		case 0xf4: case 0xf5: case 0xf6: case 0xf7:
		{
			int zlcvmask = opcode & 0xf;
			int zlcv = (opcode >> 4) & 0xf;
			int zl = (zlcv & 0xc) | ((zlcvmask >> 2) & 0x3);
			int cv = ((zlcv << 2) & 0xc) | (zlcvmask & 0x3);
			int tp = (opcode >> 8) & 0x3;
			int n = ((opcode >> 12) & 0x1) + 1;

			util::stream_format(*output, "xc      %d", n);
			print_condition_codes(true, zl, cv, tp);
			flags = STEP_COND;
			break;
		}

		case 0xe8: case 0xe9: case 0xea: case 0xeb:
		{
			int zlcvmask = opcode & 0xf;
			int zlcv = (opcode >> 4) & 0xf;
			int zl = (zlcv & 0xc) | ((zlcvmask >> 2) & 0x3);
			int cv = ((zlcv << 2) & 0xc) | (zlcvmask & 0x3);
			int tp = (opcode >> 8) & 0x3;

			util::stream_format(*output, "cc      %04X", FETCH(npc, opcodes));
			print_condition_codes(true, zl, cv, tp);
			flags = STEP_OVER | STEP_COND;
			break;
		}

		case 0xec: case 0xed: case 0xee: case 0xef:
		{
			int zlcvmask = opcode & 0xf;
			int zlcv = (opcode >> 4) & 0xf;
			int zl = (zlcv & 0xc) | ((zlcvmask >> 2) & 0x3);
			int cv = ((zlcv << 2) & 0xc) | (zlcvmask & 0x3);
			int tp = (opcode >> 8) & 0x3;

			if (opcode == 0xef00)
			{
				util::stream_format(*output, "ret");
				flags = STEP_OUT;
			}
			else
			{
				util::stream_format(*output, "retc    ");
				print_condition_codes(false, zl, cv, tp);
				flags = STEP_OUT | STEP_COND;
			}
			break;
		}

		case 0xf0: case 0xf1: case 0xf2: case 0xf3:
		{
			int zlcvmask = opcode & 0xf;
			int zlcv = (opcode >> 4) & 0xf;
			int zl = (zlcv & 0xc) | ((zlcvmask >> 2) & 0x3);
			int cv = ((zlcv << 2) & 0xc) | (zlcvmask & 0x3);
			int tp = (opcode >> 8) & 0x3;

			util::stream_format(*output, "bcndd   %04X", FETCH(npc, opcodes));
			print_condition_codes(true, zl, cv, tp);
			flags = STEP_COND | step_over_extra(1);
			break;
		}

		case 0xf8: case 0xf9: case 0xfa: case 0xfb:
		{
			int zlcvmask = opcode & 0xf;
			int zlcv = (opcode >> 4) & 0xf;
			int zl = (zlcv & 0xc) | ((zlcvmask >> 2) & 0x3);
			int cv = ((zlcv << 2) & 0xc) | (zlcvmask & 0x3);
			int tp = (opcode >> 8) & 0x3;

			util::stream_format(*output, "ccd     %04X", FETCH(npc, opcodes));
			print_condition_codes(true, zl, cv, tp);
			flags = STEP_OVER | STEP_COND | step_over_extra(1);
			break;
		}

		case 0xfc: case 0xfd: case 0xfe: case 0xff:
		{
			int zlcvmask = opcode & 0xf;
			int zlcv = (opcode >> 4) & 0xf;
			int zl = (zlcv & 0xc) | ((zlcvmask >> 2) & 0x3);
			int cv = ((zlcv << 2) & 0xc) | (zlcvmask & 0x3);
			int tp = (opcode >> 8) & 0x3;

			if (opcode == 0xff00)
			{
				util::stream_format(*output, "retd");
				flags = STEP_OUT | step_over_extra(1);
			}
			else
			{
				util::stream_format(*output, "retcd   ");
				print_condition_codes(false, zl, cv, tp);
				flags = STEP_OUT | STEP_COND | step_over_extra(1);
			}
			break;
		}

		default:    util::stream_format(*output, "???     ($%04X)", opcode); break;
	}

	return (npc-pc) | flags | SUPPORTED;
}
